tutorials/pbeTransportFoam/TaylorDispersion/0.pbe/moment.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      moment.1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    topWall      
    {
        type            zeroGradient;
    }

    bottomWall      
    {
        type            zeroGradient;
    }

    outlet      
    {
        type            zeroGradient;
    }

    inlet      
    {
        type            fixedValue;
         value           uniform 1;
    }

    frontAndBack    
    {
        type            empty;
    }
}


// ************************************************************************* //
