tutorials/pbeTransportFoam/TaylorDispersion/system/0.pbe/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0.128";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
1930
(
1.46669e-05
3.53331e-05
8.79505e-06
5.8718e-06
7.80852e-06
9.86534e-07
7.4986e-06
3.09915e-07
...
)
;

boundaryField
{
    topWall
    {
        type            calculated;
        value           uniform 0;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
-5e-05
-5e-05
-5e-05
-5e-05
-5e-05
-5e-05
-5e-05
-5e-05
-5e-05
-5e-05
-5e-05
-5e-05
-5e-05
-5e-05
-5e-05
-5e-05
-5e-05
-5e-05
-5e-05
-5e-05
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
20
(
7.45874e-06
2.08936e-05
3.2836e-05
4.32842e-05
5.22396e-05
5.97023e-05
6.56725e-05
7.01501e-05
7.31352e-05
7.46277e-05
7.46277e-05
7.31352e-05
7.01501e-05
6.56725e-05
5.97023e-05
5.22396e-05
4.32842e-05
3.2836e-05
2.08936e-05
7.45874e-06
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
