tutorials/pbeTransportFoam/TaylorDispersion/system/0.simple/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    topWall      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    bottomWall      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
	 
    inlet      
    {
        type            fixedValue;
        value           uniform (1 0 0);
	 }

    outlet      
    {
		  type            zeroGradient;
    }

    frontAndBack    
    {
        type            empty;
    }
}


// ************************************************************************* //
